// Массив - это структура данных, хранящая набор однотипных элментов, идентифицируемых по индексу.
/*
Пример:

Массив целых чисел - [1, 2, 3, 4]

Массив вещественных чисел - [1.5, 7.2, 0.54, 10,28]

Массив символов - [9, d, $, @]
*/
// Индекс элемента - позиция элемента в массиве
// Пример:
// массив - [5, 4, 2, 1]
// индекс - [0][1][2][3]
// Первый индекс массива всегда ноль(0)
// У массива всегда есть имя, для того, чтобы можно было обрашаться к его элементам

int[] arr = new int[5];

// 1.Сначала указываем тип данных для массива ( int[] )
// 2.Далее имя массива (Пример: arr)
// 3.Выделение памяти под элементы ( new int[количество] )